SE4Foam/tutorials/solarStill4SEFoam/humidAir/0/alphaV
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphaV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[1 -3 0 0 0 0 0];

internalField		uniform 0.03673;

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform 0.02661;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 0.04685;
    }

    frontAndBack
    {
	type		empty;
    }

    ".*"
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
